In [510]:
import pandas as pd 
import numpy as np

In [511]:
df=pd.read_csv('data.csv',sep=",")
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [512]:
df.loc[:,["TIME","GEO","Value"]]

     TIME                            GEO Value
0    2000  European Union (28 countries)     :
1    2001  European Union (28 countries)     :
2    2002  European Union (28 countries)  5.00
3    2003  European Union (28 countries)  5.03
4    2004  European Union (28 countries)  4.95
..    ...                            ...   ...
379  2007                        Finland  5.90
380  2008                        Finland  6.10
381  2009                        Finland  6.81
382  2010                        Finland  6.85
383  2011                        Finland  6.76

[384 rows x 3 columns]

In [513]:
df.replace(to_replace=":",value=np.nan,inplace=True)

In [514]:
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,NaN,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,NaN,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [515]:
df.dtypes

TIME                   int64
GEO                   object
INDIC_ED              object
Value                 object
Flag and Footnotes    object
dtype: object

In [516]:
df.Value=df.Value.astype('float')

In [517]:
df.Value.mean()

5.203988919667592

In [518]:
df['Value']=df['Value'].fillna(value=df.Value.mean())

In [519]:
df['Flag and Footnotes']=df['Flag and Footnotes'].fillna(method='ffill').fillna(method='bfill')

In [520]:
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,5.203989,e
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,5.203989,e
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.000000,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.030000,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.950000,e

In [521]:
df.loc[(df['Value']>5)&(df['TIME']==2011)]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.250000,e
23,2011,European Union (27 countries),Total public expenditure on education as % of ...,5.250000,e
35,2011,European Union (25 countries),Total public expenditure on education as % of ...,5.310000,e
47,2011,Euro area (18 countries),Total public expenditure on education as % of ...,5.150000,e
59,2011,Euro area (17 countries),Total public expenditure on education as % of ...,5.150000,e
71,2011,Euro area (15 countries),Total public expenditure on education as % of ...,5.160000,e
83,2011,Euro area (13 countries),Total public expenditure on education as % of ...,5.150000,e
95,2011,Belgium,Total public expenditure on education as % of ...,6.550000,d
131,2011,Denmark,Total public expenditure on education as % of ...,8.750000,d
155,2011,Estonia,Total public expenditure on education as % of ...,5.160000,d
167,2011,Ireland,Total public expenditure on education as % of ...,6.150000,d
179,2011,Greece,Total public expenditure on education as % of ...,5.203989,i
203,2011,France,Total public expenditure on education as % of ...,5.680000,i
227,2011,Cyprus,Total public expenditure on education as % of ...,7.870000,d
251,2011,Lithuania,Total public expenditure on education as % of ...,5.170000,d
263,2011,Luxembourg,Total public expenditure on education as % of ...,5.203989,d
287,2011,Malta,Total public expenditure on education as % of ...,7.960000,i
299,2011,Netherlands,Total public expenditure on education as % of ...,5.930000,i
311,2011,Austria,Total public expenditure on education as % of ...,5.800000,i
335,2011,Portugal,Total public expenditure on education as % of ...,5.270000,d
359,2011,Slovenia,Total public expenditure on education as % of ...,5.680000,u
383,2011,Finland,Total public expenditure on education as % of ...,6.760000,d

In [522]:
df.max()

TIME                                                               2011
GEO                                                               Spain
INDIC_ED              Total public expenditure on education as % of ...
Value                                                              8.81
Flag and Footnotes                                                    u
dtype: object

In [523]:
df['val_sq']=df['Value']*df['Value']

In [524]:
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes,val_sq
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,5.203989,e,27.081501
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,5.203989,e,27.081501
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.000000,e,25.000000
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.030000,e,25.300900
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.950000,e,24.502500

In [525]:
df.drop(columns="val_sq",inplace=True)

In [526]:
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,5.203989,e
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,5.203989,e
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.000000,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.030000,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.950000,e

In [527]:
df=df.append({"TIME":2000,"Value":5.00,"Flag and Footnotes":'a'},ignore_index=True)

In [528]:
df.tail()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
380,2008,Finland,Total public expenditure on education as % of ...,6.10,d
381,2009,Finland,Total public expenditure on education as % of ...,6.81,d
382,2010,Finland,Total public expenditure on education as % of ...,6.85,d
383,2011,Finland,Total public expenditure on education as % of ...,6.76,d
384,2000,NaN,NaN,5.00,a

In [529]:
df.sort_values('Value',inplace=True,ascending=False)

In [530]:
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
130,2010,Denmark,Total public expenditure on education as % of ...,8.81,d
131,2011,Denmark,Total public expenditure on education as % of ...,8.75,d
129,2009,Denmark,Total public expenditure on education as % of ...,8.74,d
121,2001,Denmark,Total public expenditure on education as % of ...,8.44,d
122,2002,Denmark,Total public expenditure on education as % of ...,8.44,d

In [548]:
g=df.pivot_table(index="GEO",columns="TIME",values="Value", aggfunc='mean')

In [ ]:
#show the mean of the values for each country over all the years

In [549]:
g

TIME,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
GEO,,,,,,,,,,,,
Austria,5.660000,5.740000,5.68,5.53,5.48,5.44,5.400000,5.330000,5.470000,5.980000,5.910000,5.800000
Belgium,5.203989,5.990000,6.09,6.02,5.95,5.92,5.980000,6.000000,6.430000,6.570000,6.580000,6.550000
Bulgaria,3.880000,3.700000,3.94,4.09,4.40,4.25,4.040000,3.880000,4.440000,4.580000,4.100000,3.820000
Cyprus,5.420000,5.980000,6.60,7.37,6.77,6.95,7.020000,6.950000,7.450000,7.980000,7.920000,7.870000
Czech Republic,3.830000,3.930000,4.15,4.32,4.20,4.08,4.420000,4.050000,3.920000,4.360000,4.250000,4.510000
Denmark,8.280000,8.440000,8.44,8.33,8.43,8.30,7.970000,7.810000,7.680000,8.740000,8.810000,8.750000
Estonia,5.570000,5.240000,5.47,5.29,4.92,4.88,4.700000,4.720000,5.610000,6.030000,5.660000,5.160000
Euro area (13 countries),5.203989,4.970000,5.00,5.04,4.95,4.89,4.870000,4.800000,4.940000,5.320000,5.280000,5.150000
Euro area (15 countries),5.203989,4.980000,5.01,5.04,4.96,4.89,4.870000,4.810000,4.950000,5.320000,5.290000,5.160000
Euro area (17 countries),5.203989,5.203989,4.86,4.89,4.80,4.72,4.690000,4.790000,4.940000,5.310000,5.280000,5.150000
Euro area (18 countries),5.203989,5.203989,4.87,4.89,4.80,4.72,4.690000,4.790000,4.940000,5.310000,5.280000,5.150000
European Union (25 countries),4.940000,5.020000,5.03,5.06,4.98,4.95,4.930000,4.950000,5.060000,5.410000,5.460000,5.310000
European Union (27 countries),4.910000,4.990000,5.00,5.04,4.95,4.92,4.910000,4.930000,5.040000,5.380000,5.410000,5.250000
European Union (28 countries),5.203989,5.203989,5.00,5.03,4.95,4.92,4.910000,4.920000,5.040000,5.380000,5.410000,5.250000
Finland,5.890000,6.060000,6.22,6.43,6.42,6.30,6.180000,5.900000,6.100000,6.810000,6.850000,6.760000
France,6.040000,5.950000,5.90,5.92,5.80,5.67,5.610000,5.620000,5.620000,5.900000,5.860000,5.680000
Germany (until 1990 former territory of the FRG),4.450000,4.510000,4.72,4.74,4.62,4.57,4.430000,4.490000,4.570000,5.060000,5.080000,4.980000
Greece,3.710000,3.500000,3.57,3.56,3.83,4.09,5.203989,5.203989,5.203989,5.203989,5.203989,5.203989
Hungary,4.500000,5.060000,5.39,5.91,5.44,5.46,5.440000,5.290000,5.100000,5.120000,4.900000,4.710000
Ireland,4.290000,4.240000,4.27,4.35,4.66,4.72,4.730000,4.920000,5.670000,6.430000,6.410000,6.150000
Italy,4.520000,4.830000,4.60,4.72,4.56,4.41,4.670000,4.270000,4.560000,4.700000,4.500000,4.290000
Latvia,5.640000,7.220000,6.60,5.58,5.12,5.14,5.130000,5.070000,5.710000,5.590000,4.960000,4.960000
Lithuania,5.630000,5.860000,5.81,5.14,5.17,4.88,4.820000,4.640000,4.880000,5.640000,5.360000,5.170000
Luxembourg,5.203989,3.750000,3.79,3.77,3.87,3.78,3.410000,3.150000,5.203989,5.203989,5.203989,5.203989
Malta,4.520000,4.270000,4.22,4.48,4.66,6.58,6.450000,6.180000,5.720000,5.320000,6.740000,7.960000
Netherlands,4.980000,5.090000,5.22,5.47,5.50,5.53,5.500000,5.320000,5.500000,5.950000,5.980000,5.930000
Poland,4.870000,5.420000,5.41,5.35,5.41,5.47,5.250000,4.910000,5.080000,5.090000,5.170000,4.940000
Portugal,5.420000,5.390000,5.33,5.38,5.10,5.21,5.070000,5.100000,4.890000,5.790000,5.620000,5.270000
Romania,2.880000,3.250000,3.51,3.45,3.28,3.48,5.203989,4.250000,5.203989,4.240000,3.530000,3.070000
Slovakia,3.920000,3.990000,4.31,4.30,4.19,3.85,3.800000,3.620000,3.610000,4.090000,4.220000,4.060000
Slovenia,5.203989,5.860000,5.76,5.80,5.74,5.73,5.720000,5.150000,5.200000,5.690000,5.680000,5.680000
Spain,4.280000,4.240000,4.25,4.28,4.25,4.23,4.260000,4.340000,4.620000,5.020000,4.980000,4.820000

In [ ]:
#Change DataFrame to country names as the index, while the columns will be the years starting from 2006 and the values will be the previousÂ 'Value'Â column.

In [562]:
g.iloc[:,6:12]

TIME,2006,2007,2008,2009,2010,2011
GEO,,,,,,
Austria,5.400000,5.330000,5.470000,5.980000,5.910000,5.800000
Belgium,5.980000,6.000000,6.430000,6.570000,6.580000,6.550000
Bulgaria,4.040000,3.880000,4.440000,4.580000,4.100000,3.820000
Cyprus,7.020000,6.950000,7.450000,7.980000,7.920000,7.870000
Czech Republic,4.420000,4.050000,3.920000,4.360000,4.250000,4.510000
Denmark,7.970000,7.810000,7.680000,8.740000,8.810000,8.750000
Estonia,4.700000,4.720000,5.610000,6.030000,5.660000,5.160000
Euro area (13 countries),4.870000,4.800000,4.940000,5.320000,5.280000,5.150000
Euro area (15 countries),4.870000,4.810000,4.950000,5.320000,5.290000,5.160000
Euro area (17 countries),4.690000,4.790000,4.940000,5.310000,5.280000,5.150000
Euro area (18 countries),4.690000,4.790000,4.940000,5.310000,5.280000,5.150000
European Union (25 countries),4.930000,4.950000,5.060000,5.410000,5.460000,5.310000
European Union (27 countries),4.910000,4.930000,5.040000,5.380000,5.410000,5.250000
European Union (28 countries),4.910000,4.920000,5.040000,5.380000,5.410000,5.250000
Finland,6.180000,5.900000,6.100000,6.810000,6.850000,6.760000
France,5.610000,5.620000,5.620000,5.900000,5.860000,5.680000
Germany (until 1990 former territory of the FRG),4.430000,4.490000,4.570000,5.060000,5.080000,4.980000
Greece,5.203989,5.203989,5.203989,5.203989,5.203989,5.203989
Hungary,5.440000,5.290000,5.100000,5.120000,4.900000,4.710000
Ireland,4.730000,4.920000,5.670000,6.430000,6.410000,6.150000
Italy,4.670000,4.270000,4.560000,4.700000,4.500000,4.290000
Latvia,5.130000,5.070000,5.710000,5.590000,4.960000,4.960000
Lithuania,4.820000,4.640000,4.880000,5.640000,5.360000,5.170000
Luxembourg,3.410000,3.150000,5.203989,5.203989,5.203989,5.203989
Malta,6.450000,6.180000,5.720000,5.320000,6.740000,7.960000
Netherlands,5.500000,5.320000,5.500000,5.950000,5.980000,5.930000
Poland,5.250000,4.910000,5.080000,5.090000,5.170000,4.940000
Portugal,5.070000,5.100000,4.890000,5.790000,5.620000,5.270000
Romania,5.203989,4.250000,5.203989,4.240000,3.530000,3.070000
Slovakia,3.800000,3.620000,3.610000,4.090000,4.220000,4.060000
Slovenia,5.720000,5.150000,5.200000,5.690000,5.680000,5.680000
Spain,4.260000,4.340000,4.620000,5.020000,4.980000,4.820000

In [372]:
df1=pd.read_table('https://ec.europa.eu/eurostat/estat-navtree-portlet-prod/BulkDownloadListing?file=data/tps00053.tsv.gz',sep = "\,|\t+",compression="gzip")

In [373]:
df1.head()

,duration,isced11,age,sex,unit,geo\time,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Y1-3,ED3-8,Y20-34,F,PC,AT,89.7,86.9,87.2,89.6,90.2,87.8,86.8 b,86.4,88.2,90.0,85.9,87.4
1,Y1-3,ED3-8,Y20-34,F,PC,BE,82.1 b,80.8,80.6,81.4 b,79.7,79.1,80.2 b,80.9,82.2,82.5 b,84.2,84.0
2,Y1-3,ED3-8,Y20-34,F,PC,BG,76.0 b,71.2,72.3 b,60.6,67.3,69.1,66.4 b,73.9,68.9,77.5,74.6,76.3
3,Y1-3,ED3-8,Y20-34,F,PC,CH,88.4,88.0,84.4 b,86.0,87.5,86.4,89.0 b,85.3,84.6,89.9,88.6,87.9
4,Y1-3,ED3-8,Y20-34,F,PC,CY,86.0,79.5 b,78.7,72.0,71.6,61.7,68.9 b,69.8,74.2,73.8,82.5,79.1

In [374]:
df1.dtypes

duration     object
isced11      object
age          object
sex          object
unit         object
geo\time     object
2008         object
2009         object
2010         object
2011         object
2012        float64
2013         object
2014         object
2015         object
2016         object
2017         object
2018         object
2019        float64
dtype: object

In [375]:
df1.head()

,duration,isced11,age,sex,unit,geo\time,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Y1-3,ED3-8,Y20-34,F,PC,AT,89.7,86.9,87.2,89.6,90.2,87.8,86.8 b,86.4,88.2,90.0,85.9,87.4
1,Y1-3,ED3-8,Y20-34,F,PC,BE,82.1 b,80.8,80.6,81.4 b,79.7,79.1,80.2 b,80.9,82.2,82.5 b,84.2,84.0
2,Y1-3,ED3-8,Y20-34,F,PC,BG,76.0 b,71.2,72.3 b,60.6,67.3,69.1,66.4 b,73.9,68.9,77.5,74.6,76.3
3,Y1-3,ED3-8,Y20-34,F,PC,CH,88.4,88.0,84.4 b,86.0,87.5,86.4,89.0 b,85.3,84.6,89.9,88.6,87.9
4,Y1-3,ED3-8,Y20-34,F,PC,CY,86.0,79.5 b,78.7,72.0,71.6,61.7,68.9 b,69.8,74.2,73.8,82.5,79.1

In [376]:
df1.iloc[:,6:18]=df1.iloc[:,6:18].astype(str)
df1.iloc[:,6:18]=df1.iloc[:,6:18].apply(lambda x: x.str.replace("[A-Za-z]", ""),axis=1)

In [377]:
df1.replace(to_replace=": ",value=np.nan,inplace=True)

In [378]:
df1.head()

,duration,isced11,age,sex,unit,geo\time,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Y1-3,ED3-8,Y20-34,F,PC,AT,89.7,86.9,87.2,89.6,90.2,87.8,86.8,86.4,88.2,90.0,85.9,87.4
1,Y1-3,ED3-8,Y20-34,F,PC,BE,82.1,80.8,80.6,81.4,79.7,79.1,80.2,80.9,82.2,82.5,84.2,84.0
2,Y1-3,ED3-8,Y20-34,F,PC,BG,76.0,71.2,72.3,60.6,67.3,69.1,66.4,73.9,68.9,77.5,74.6,76.3
3,Y1-3,ED3-8,Y20-34,F,PC,CH,88.4,88.0,84.4,86.0,87.5,86.4,89.0,85.3,84.6,89.9,88.6,87.9
4,Y1-3,ED3-8,Y20-34,F,PC,CY,86.0,79.5,78.7,72.0,71.6,61.7,68.9,69.8,74.2,73.8,82.5,79.1

In [379]:
df1.columns.values

array(['duration', 'isced11', 'age', 'sex', 'unit', 'geo\\time', '2008 ',
       '2009 ', '2010 ', '2011 ', '2012 ', '2013 ', '2014 ', '2015 ',
       '2016 ', '2017 ', '2018 ', '2019'], dtype=object)

In [380]:
for i in range(6,18):
  df1.iloc[:,i]=df1.iloc[:,i].astype(float)

In [381]:
df1.dtypes

duration     object
isced11      object
age          object
sex          object
unit         object
geo\time     object
2008        float64
2009        float64
2010        float64
2011        float64
2012        float64
2013        float64
2014        float64
2015        float64
2016        float64
2017        float64
2018        float64
2019        float64
dtype: object

In [382]:
df1.head()

,duration,isced11,age,sex,unit,geo\time,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Y1-3,ED3-8,Y20-34,F,PC,AT,89.7,86.9,87.2,89.6,90.2,87.8,86.8,86.4,88.2,90.0,85.9,87.4
1,Y1-3,ED3-8,Y20-34,F,PC,BE,82.1,80.8,80.6,81.4,79.7,79.1,80.2,80.9,82.2,82.5,84.2,84.0
2,Y1-3,ED3-8,Y20-34,F,PC,BG,76.0,71.2,72.3,60.6,67.3,69.1,66.4,73.9,68.9,77.5,74.6,76.3
3,Y1-3,ED3-8,Y20-34,F,PC,CH,88.4,88.0,84.4,86.0,87.5,86.4,89.0,85.3,84.6,89.9,88.6,87.9
4,Y1-3,ED3-8,Y20-34,F,PC,CY,86.0,79.5,78.7,72.0,71.6,61.7,68.9,69.8,74.2,73.8,82.5,79.1

In [501]:
g=df1.groupby('sex')
g.mean()["2016 "]

sex
F    74.760526
M    79.165789
T    76.876316
Name: 2016 , dtype: float64

In [505]:
g.mean().loc["F","2008 ":"2019"].astype(float).idxmax()

'2008 '

In [466]:
df1=df1.rename(columns={"geo\\time":"geotime"})

In [427]:
df1.head()

,duration,isced11,age,sex,unit,geotime,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Y1-3,ED3-8,Y20-34,F,PC,AT,89.7,86.9,87.2,89.6,90.2,87.8,86.8,86.4,88.2,90.0,85.9,87.4
1,Y1-3,ED3-8,Y20-34,F,PC,BE,82.1,80.8,80.6,81.4,79.7,79.1,80.2,80.9,82.2,82.5,84.2,84.0
2,Y1-3,ED3-8,Y20-34,F,PC,BG,76.0,71.2,72.3,60.6,67.3,69.1,66.4,73.9,68.9,77.5,74.6,76.3
3,Y1-3,ED3-8,Y20-34,F,PC,CH,88.4,88.0,84.4,86.0,87.5,86.4,89.0,85.3,84.6,89.9,88.6,87.9
4,Y1-3,ED3-8,Y20-34,F,PC,CY,86.0,79.5,78.7,72.0,71.6,61.7,68.9,69.8,74.2,73.8,82.5,79.1

In [442]:
100*len(df1.loc[df1["geotime"]=="EU27_2020"]["2010 "])-df1.loc[df1["geotime"]=="EU27_2020"]["2010 "].sum()

69.5

In [506]:
df2=df1.melt(id_vars="geotime",value_vars=["2008 ","2009 ","2010 ","2011 ","2012 ","2013 ","2014 ","2015 ","2016 ","2017 ","2018 ","2019"],var_name="year",value_name="unemployment rate")

In [508]:
df2["unemployment rate"]=100-df2["unemployment rate"]

In [509]:
df2

     geotime   year  unemployment rate
0         AT  2008                10.3
1         BE  2008                17.9
2         BG  2008                24.0
3         CH  2008                11.6
4         CY  2008                14.0
...      ...    ...                ...
1363      SE   2019               11.3
1364      SI   2019               14.0
1365      SK   2019               16.1
1366      TR   2019               42.2
1367      UK   2019               14.6

[1368 rows x 3 columns]